# Python Development
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
ms-python.pylint
ms-python.autopep8
kevinrose.vsc-python-indent

# IA Assistants
github.copilot
github.copilot-chat
blackboxapp.blackbox
sourcegraph.cody-ai

# Development Tools
eamodio.gitlens
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
streetsidesoftware.code-spell-checker
usernamehw.errorlens
yzhang.markdown-all-in-one
dracula-theme.theme-dracula
pkief.material-icon-theme

# Jupyter
ms-toolsai.jupyter